<template>

    <div class="container-fluid" style="background-color:#000000">
        <div class="row h-100 mt-3">
            <h1 class="mt-5 ms-3 fw-bold text-white text-center">產業鏈</h1>
            <Industry_ValueChain
                v-for="ChainItem in ChainItems"
                :ChainItem="ChainItem"
            ></Industry_ValueChain>
        </div>
    </div>

    <div class="container-fluid" >
        <div class="row h-100 mt-3">
            <h1 class="mt-5 ms-3 fw-bold text-dark text-center">產業矩陣</h1>
        </div>
    </div>

</template>

<script>
import Industry_ValueChain from '../../../components/Industry/Industry_ValueChain'

export default {
    name:'Textile',
    components:{
        Industry_ValueChain
    },
    data(){
        return{
            ChainItems:[
                {'Title':'原物料-按成份',
                'subtitle':[{'Title':'天然纖維',
                            'Detail':[{cat:'植物纖維',com:['']},
                            {cat:'動物纖維',com:[['利華','中和','怡華']],code:[['1423','1439','1456']]},
                            {cat:'礦物纖維',com:[['宏遠','南緯']],code:[['1460','1467']]}],
                            
                            'html':['天然纖維產業','#']},

                            {'Title':'人工纖維',
                            'Detail':[{cat:'再生纖維',com:[['台化','聚隆']],code:[['1326','1466']]},
                                    {cat:'半合成纖維',com:[['南紡']],code:[['1440']]},
                                    {cat:'合成纖維',com:[['南亞','台化','遠東新'],
                                    ['新纖','宏洲','東華'],['力麗','力鵬','集盛'],
                                    ['聚隆','三洋實業','宜新實業'],['宏遠']],
                                    code:[['1303','1326','1402'],
                                    ['1409','1413','1418'],['1444','1447','1455'],
                                    ['1466','1472','4440'],['1460']]},
                                    {cat:'無機纖維',com:['']}],
                            'html':['人工纖維產業','#']}],
                'Process':'纖維加工'},

                {'Title':'紗線-按加工方式',
                'subtitle':[{'Title':'紡紗',
                            'Detail':[{cat:'短纖紗',com:[['利華','中和','怡華'],
                            ['台化','南紡','大東'],['佳和','弘裕']],code:[['1423','1439','1456'],
                            ['1326','1440','1441'],['1449','1474']]},
                            {cat:'長纖紗',com:[['遠東新','新纖','宏洲'],['南紡','力麗','力鵬'],
                            ['宏益','集盛','宜進'],['聯發','得力','昶和'],['東隆興','福大','新昕纖'],
                            ['台富','光明','東和'],['福懋','大東','大宇'],['佳和','年興','宏遠'],['弘裕']],
                            code:[['1402','1409','1413'],['1440','1444','1447'],
                            ['1452','1455','1457'],['1459','1464','1468'],['4401','4402','4406'],
                            ['1454','4420','1414'],['1434','1441','1445'],['1449','1451','1460'],['1474']]},
                            {cat:'長纖短紡紗',com:[['東華']],code:[['1418']]}],
                            'html':['紡紗產業','#']}],
                'Process':'織布'},


                {'Title':'布料-按編織方式',
                'subtitle':[{'Title':'布料',
                            'Detail':[{cat:'針織布',com:[['遠東新','力麗','力鵬'],['得力','偉全','儒鴻'],
                            ['大東','大宇','宏遠'],['利勤','南緯']],
                            code:[['1402','1444','1447'],['1464','1465','1476'],
                            ['1441','1445','1460'],['4426','1467']]},
                            {cat:'梭織布',com:[['力鵬','宜進','偉全'],
                            ['昶和','福大','大東'],['年興','弘裕','南緯']],code:[['1447','1457','1465'],
                            ['1468','4402','1441'],['1451','1474','1467']]},
                            {cat:'不織布',com:[['南六','新麗']],code:[['6504','9944']]}],
                            'html':['織布產業','#']}],
                'Process':'染整'},

                {'Title':'成品',
                'subtitle':[{'Title':'成品布',
                            'Detail':[{cat:'運動服飾',com:[['南緯','儒鴻','聚陽']],code:[['1467','1476','1477']]},
                            {cat:'牛仔類服飾',com:[['年興']],code:[['1451']]},
                            {cat:'雨衣',com:[['達新']],code:[['1315']]},
                            {cat:'一般服飾',com:[['遠東新','南緯','台南'],['儒鴻','聚陽']],
                            code:[['1402','1467','1473'],['1476','1477']]},
                            {cat:'寢飾',com:[['遠東新','南緯','聚陽']],code:[['1402','1467','1477']]},
                            {cat:'羽絨外套',com:[['廣越']],code:[['4438']]},
                            {cat:'口罩',com:[['南六']],code:[['6504']]}],
                            
                            'html':['天然纖維產業','#']}],
                'Process':''}
            ]}
        }

    }

</script>